Тест/Тест/src/Documents/ПеремещениеТМЦВорктрак/ПеремещениеТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТМЦВорктрак</name>
  <basedOn>Document.ПоступлениеТМЦВорктрак</basedOn>
  <registerRecords>AccumulationRegister.ДвижениеТМЦВорктрак</registerRecords>
  <registerRecords>AccumulationRegister.БюджетТМЦ</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРасхода_3</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТМЦ</name>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.ИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладСписания</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Catalogs/ВидыРасходов_3/ВидыРасходов_3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРасходов_3</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Влияние</name>
    <type>
      <types>CatalogRef.ВлиянияРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительРодитель</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительРодительРодитель</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ОргСтруктураРасходы</name>
    <type>
      <types>CatalogRef.ОргСтруктураРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаВлияние</name>
    <attributes>
      <name>Влияние</name>
      <type>
        <types>CatalogRef.ВлиянияРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Documents/ПеремещениеТМЦВорктрак/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СписокТМЦКоличествоПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("СписокТМЦ", "Цена");
КонецПроцедуры


&НаКлиенте
Процедура СписокТМЦЦенаПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("СписокТМЦ", "Цена");
КонецПроцедуры


//&НаКлиенте
//Процедура СписокТМЦИнвентарныйНомерПриИзменении(Элемент)
//	
//	//ТекСтрока = Элементы.СписокТМЦ.ТекущиеДанные;
//	//
//	//РаботаСДокументамиТМЦКлиент.УстановитьДанныеПоИнвентарномуНомеру(ТекСтрока);
//	//
//	//ОбработкаИзмененияСтроки("СписокТМЦ", "Цена");
//	
//КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьАктПеремещения(Команда)
	
	///+ГомзМА 14.04.2023 
	ТабДок = ПечатьАктСписанияНаСервере();
	
	// создадим коллекцию печатных форм, в которую надо будет добавить нужный нам табличный документ
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("АктПеремещения");
	// Добавляем в коллекцию (тип массив) сформированный Табличный документ
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	// если требуется устанавливаем параметры печати
	КоллекцияПечатныхФорм[0].Экземпляров=1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "АктПеремещения";  // используется для формирования имени файла при сохранении из общей формы печати документов
	// .. и выводим стандартной процедурой БСП
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	///-ГомзМА 14.04.2023
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиенте
Процедура ОбработкаИзмененияСтроки(ИмяТабличнойЧасти, Поле = Неопределено, ДанныеСтроки = Неопределено)
	
	ТекДанные = ?(ДанныеСтроки = Неопределено, Элементы[ИмяТабличнойЧасти].ТекущиеДанные, ДанныеСтроки);
	
	Если Поле = "Сумма" Тогда
		Если ТекДанные.Количество <> 0 Тогда
			ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество;
		КонецЕсли;	
	Иначе	
		ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаИзмененияСтроки()


&НаСервере
Функция ПечатьАктСписанияНаСервере()
	
	///+ГомзМА 02.05.2023 
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ПеремещениеТМЦВорктрак.ПолучитьМакет("АктПеремещения");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТМЦВорктракСписокТМЦ.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеТМЦВорктракСписокТМЦ.ТМЦ КАК ТМЦ,
	|	ПеремещениеТМЦВорктракСписокТМЦ.Количество КАК Количество,
	|	ПеремещениеТМЦВорктракСписокТМЦ.Цена КАК Цена,
	|	ПеремещениеТМЦВорктракСписокТМЦ.Сумма КАК Сумма,
	|	ПеремещениеТМЦВорктракСписокТМЦ.Склад КАК Склад,
	|	ПеремещениеТМЦВорктракСписокТМЦ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПеремещениеТМЦВорктракСписокТМЦ.СерийныйНомер КАК СерийныйНомер,
	|	ПеремещениеТМЦВорктракСписокТМЦ.Ссылка.Ссылка КАК Ссылка,
	|	ПеремещениеТМЦВорктракСписокТМЦ.Ссылка.Ответственный КАК Ответственный,
	|	ПеремещениеТМЦВорктракСписокТМЦ.Ссылка.Номер КАК Номер,
	|	ПеремещениеТМЦВорктракСписокТМЦ.Ссылка.Дата КАК Дата,
	|	ПеремещениеТМЦВорктракСписокТМЦ.Ссылка.Комментарий КАК Комментарий,
	|	ПеремещениеТМЦВорктракСписокТМЦ.ТМЦ.Код КАК ТМЦКод
	|ИЗ
	|	Документ.ПеремещениеТМЦВорктрак.СписокТМЦ КАК ПеремещениеТМЦВорктракСписокТМЦ
	|ГДЕ
	|	ПеремещениеТМЦВорктракСписокТМЦ.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВыборкаЗапрос = Запрос.Выполнить().Выбрать();
		
	ОбластьШапка  = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ТабДок.Очистить();
	
	ВыборкаЗапрос.Следующий();
	
	ОбластьШапка.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьШапка, ВыборкаЗапрос.Уровень());
	
	ОбластьСтрока.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьСтрока, ВыборкаЗапрос.Уровень());
		
	Пока ВыборкаЗапрос.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаЗапрос);
		ТабДок.Вывести(ОбластьСтрока, ВыборкаЗапрос.Уровень());
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	Возврат ТабДок;
	///-ГомзМА 02.05.2023
КонецФункции

&НаКлиенте
Процедура СписокТМЦИнвентарныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	///+ГомзМА 19.05.2023
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.СписокТМЦ.ТекущиеДанные;
	
	ОткрытьФорму("Справочник.ИнвентарныеНомера.ФормаВыбора",, ЭтаФорма,ЭтаФорма.УникальныйИдентификатор);
	///-ГомзМА 19.05.2023
	
КонецПроцедуры


//&НаСервере 
//Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
//	
//	ДобавлениеИнвентарногоНомера(Значение, ДопПараметры);
//	
//КонецПроцедуры


&НаСервере
Процедура ДобавлениеИнвентарногоНомера(ДанныеЗаполнения, ИнвентарныйНомер)
	
	ИнвентарныйНомер = ДанныеЗаполнения.Ссылка;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Перем Команда;
	
	Если ТипЗнч(ВыбранноеЗначение.Ссылка) = Тип("СправочникСсылка.ИнвентарныеНомера") Тогда
		
		ТекСтрока = Элементы.СписокТМЦ.ТекущиеДанные;
		ВыбранноеЗначение.Свойство("Команда", Команда);
		Если Команда = "ПравильныйПоиск" Тогда
			ТекСтрока.ИнвентарныйНомер = ВыбранноеЗначение.Ссылка;
		КонецЕсли;
		
		ТекСтрока = Элементы.СписокТМЦ.ТекущиеДанные;
		
		РаботаСДокументамиТМЦКлиент.УстановитьДанныеПоИнвентарномуНомеру(ТекСтрока);
		
		ОбработкаИзмененияСтроки("СписокТМЦ", "Цена");
	
	КонецЕсли; 	
КонецПроцедуры

#КонецОбласти


&НаСервере
Функция ПолучитьРодителяВидыРасходов_3()
	
	Родитель = Справочники.ВидыРасходов_3.НайтиПоКоду("000000001");
	Возврат Родитель ;

КонецФункции

&НаКлиенте
Процедура ФилиалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Объект.Отдел 				= Неопределено; 
	Объект.ВидыРасхода_3 	= Неопределено; 
	Объект.Категория 		= Неопределено;
	Объект.Статья 			= Неопределено;
	
	
	
	СтандартнаяОбработка = ЛОЖЬ;
    Родитель = ПолучитьРодителяВидыРасходов_3();
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", Родитель);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Филиал");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Форм.Заголовок = "Категории расходов";
КонецПроцедуры

&НаКлиенте
Процедура ОтделНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		 
	Объект.ВидыРасхода_3 	= Неопределено; 
	Объект.Категория 		= Неопределено;
	Объект.Статья 			= Неопределено;
	
	СтандартнаяОбработка = ЛОЖЬ;
    
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", объект.Филиал);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Отдел");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Форм.Заголовок = "Категории расходов";
КонецПроцедуры

&НаКлиенте
Процедура СтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
				
			 	Отбор = Новый Структура();
			   Отбор.Вставить("РодительРодительРодитель", Объект.Отдел);
			   Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
			   Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
			   Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			    
			   ПараметрыФормы = Новый Структура();
			   ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
			   ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
			   ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
			   ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
			   ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			   ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
			   ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
				ПараметрыФормы.Вставить("Отбор", Отбор);
			
				ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Статья");
				Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
				ЭтаФорма, , , , ОбработкаВыбора);
				Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
				Форм.Заголовок = "Категории расходов";
КонецПроцедуры

ФУНКЦИЯ ОпределитьКатегориюСтатьи(Значение)
	
	Возврат Значение.Родитель; 
	
КонецФункции
ФУНКЦИЯ ОпределитьВидСтатьи(Значение)
	
	Возврат Значение.Родитель.Родитель; 
	
КонецФункции

ФУНКЦИЯ ОпределитьОргСтруктураРасходыКод(Значение)
	
	Возврат Значение.ОргСтруктураРасходы.Код; 
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
	

   
   //Дополнительные условия если необходимо
   Если ДопПараметры = "Филиал" тогда

    	Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Филиал = Значение ///Если Множественный Выбор - то вернется массив 
    
    ИНачеЕсли ДопПараметры = "Отдел" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Отдел = Значение; ///Если Множественный Выбор - то вернется массив
   		//ЗаполнениеСпискаВлияние(); 
     ИНачеЕсли ДопПараметры = "Категория" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Категория = Значение ///Если Множественный Выбор - то вернется массив
   
   ИНачеЕсли ДопПараметры = "Статья" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Статья = Значение;  ///Если Множественный Выбор - то вернется массив
   		
   		Если НЕ ЗначениеЗаполнено(Объект.Категория) ТОгда 
   			Объект.Категория = ОпределитьКатегориюСтатьи(Значение);
   		КонецЕсли;  
   		
   		Если НЕ ЗначениеЗаполнено(Объект.ВидыРасхода_3) ТОгда 
   			Объект.ВидыРасхода_3 = ОпределитьВидСтатьи(Значение);
   		КонецЕсли;
   		
   		
   ИНачеЕсли ДопПараметры = "Статья2" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Статья = Значение ///Если Множественный Выбор - то вернется массив
   
   ИНачеЕсли ДопПараметры = "Виды_Расходов_3" тогда
		
		Если Значение = Неопределено Тогда  
        	Возврат;
    	КонецЕсли;
    	
    	Объект.ВидыРасхода_3 = Значение;  
   	
   		Если ОпределитьОргСтруктураРасходыКод(Значение)  =  "000000003" Тогда  // 03 - Зарплата / 04 - расход
        		Элементы.Категория.ТолькоПросмотр = ложь; 
        	Иначе Элементы.Категория.ТолькоПросмотр = Истина; 
    		КонецЕсли;
   	
    КонецЕсли;
  

КонецПроцедуры
